from lesson4.task1.task import change_month


def test_add():
    assert change_month('05.12.12', 7) == '05.07.13', '05.12.12 + 7 = 05.07.13. Провеяем на '
    assert change_month('01.11.10', -5) == '01.06.10', '01.11.10 - 5 = 01.06.10. Провеяем на '
    assert change_month('05.12.12', -7) == '05.05.12', '05.12.12 - 7 = 05.05.12. Провеяем на '
    assert change_month('30.03.21', -1) == '28.02.21', '30.03.21 - 1 = 28.02.21. Провеяем на '
    assert change_month('29.02.12', 12) == '28.02.13', '29.02.12 + 12 = 28.02.13. Провеяем на '
    assert change_month('05.12.12', 0) == '05.12.12', '05.12.12 + 0 = 05.12.12. Провеяем на '
    assert change_month('31.12.21', 2) == '28.02.22', '31.12.21 + 2 = 28.02.22. Провеяем на '
    assert change_month('29.02.12', 48) == '29.02.16', '29.02.12 + 48 = 29.02.16. Провеяем на '
