from lesson1.task5.task import task5


def test_add():
    assert task5('89997776655') == True, "Допустимый номер: 89997776655"
    assert task5('8 999 777 66 55') == True, "Допустимый номер: 8 999 777 66 55"
    assert task5('8-999-777-66-55') == True, "Допустимый номер: 8-999-777-66-55"
    assert task5('+7 999 777 66 55') == True, "Допустимый номер: +7 999 777 66 55"
    assert task5('+79997776655') == True, "Допустимый номер: +79997776655'"
    assert task5('+7-999-777-66-55') == True, "Допустимый номер: +7-999-777-66-55"
    assert task5('a7-999-777-66-55') == False, "Сивол 'а'  недопустим: a7-999-777-66-55"
    assert task5('!7a999-777-66*55') == False, "Сиволы '!', 'а', '*' недопустимы: !7a999-777-66*55"
